{
    "name": "strijder",
    "gender": "Male",
    "race": "Human",
    "time_period": "Future",
    "setting": "Realism",
    "role": "Warrior",
    "favorites": {
        "music": "Rock",
        "movies": "Blade runner, the revenant",
        "books": "Dune, lotr, scripture",
        "graphics_style": "A mix"
    },
    "physical_attributes": {
        "weight": "95kg",
        "height": "188cm",
        "looks": "Handsome",
        "hair_color": "Black",
        "hair_length": "Shaved",
        "tattoos": "Unit badge on right shoulder"
    },
    "strengths": [
        "Endurance",
        "Perception",
        "Spiritual Guidance"
    ],
    "weaknesses": [],
    "skills": [
        "Combat",
        "Survival",
        "Tactics"
    ],
    "inventory": [],
    "relationships": {},
    "personality": {
        "alignment": "Neutral",
        "traits": []
    },
    "role_details": "Mercenary",
    "role_motivation": "Survival",
    "role_field": "",
    "role_goal": "",
    "role_ship": "",
    "role_fleet": "",
    "resources": {
        "health": 100,
        "credits": 1000,
        "fuel": 100,
        "supplies": 100,
        "reputation": 50,
        "time": {
            "cycles": 0,
            "hours": 0
        }
    },
    "current_event": {
        "type": "dialogue",
        "description": "Your first day in the sprawling cyberpunk metropolis.",
        "choices": [
            "Gather information",
            "Take action",
            "Call for backup"
        ],
        "context": {},
        "last_interaction": "3",
        "last_scene": "\u001b[33mAs you enter the shop, the flickering neon light casts dancing shadows on the dusty walls. The air is stale and heavy with the scent of old paper and dust. The shelves are lined with a hodgepodge of old electronics and weapons, their prices scrawled in faded marker on the tags.\n\nYour eyes are drawn to the safe behind the counter. It's an old, rusted model with a dial lock and a solid metal door. The lock is old and worn, but it looks like it might still be functional. You can see the faint outline of a keyhole at the bottom of the dial.\n\nAs you approach the safe, you notice a worn-out ledger sitting on the counter. It looks like it might contain some valuable information, or at least some clues about what happened to you. You open the ledger and begin to read the entries, scanning the handwriting for any useful information.\n\nThe entries are mostly sales records, but there are a few notes scribbled in the margins. One of them catches your eye: \"Need to get rid of this ASAP. Hands off or there will be consequences.\" You can't tell what \"this\" refers to, but it's clear that someone didn't want anyone finding out about it.\n\nAs you're reading the ledger, you hear a faint sound coming from the back of the shop. It sounds like someone is moving around back there. You can't tell if it's friendly or not, but you know you can't afford to take any chances in this dangerous city.\n\nYou draw your weapon and slowly make your way towards the back of the shop, your senses on high alert. The sound gets louder as you approach, and you can see a faint light flickering through the crack under the door.\n\nWhat do you do?\n\n1. Try to open the door quietly and see who's inside.\n2. Rush the door and barge in, guns blazing.\n3. Wait outside the door and listen for more information before making a move.\n4. Leave the shop and continue exploring the alleyway.\u001b[0m"
    },
    "nsfw_enabled": true
}